MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFM144/mcu.h
#define _DEVCFG1_FWDTWINSZ_POSITION              0x00000018
#define _DEVCFG1_FWDTWINSZ_MASK                  0x03000000
#define _DEVCFG1_FWDTWINSZ_LENGTH                0x00000002

#define _DEVCFG1_DMTCNT_POSITION                 0x0000001A
#define _DEVCFG1_DMTCNT_MASK                     0x7C000000
#define _DEVCFG1_DMTCNT_LENGTH                   0x00000005

#define _DEVCFG1_FDMTEN_POSITION                 0x0000001F
#define _DEVCFG1_FDMTEN_MASK                     0x80000000
#define _DEVCFG1_FDMTEN_LENGTH                   0x00000001

#define _DEVCFG1_w_POSITION                      0x00000000
#define _DEVCFG1_w_MASK                          0xFFFFFFFF
#define _DEVCFG1_w_LENGTH                        0x00000020

#define _DEVCFG0_DEBUG_POSITION                  0x00000000
#define _DEVCFG0_DEBUG_MASK                      0x00000003
#define _DEVCFG0_DEBUG_LENGTH                    0x00000002

#define _DEVCFG0_JTAGEN_POSITION                 0x00000002
#define _DEVCFG0_JTAGEN_MASK                     0x00000004
#define _DEVCFG0_JTAGEN_LENGTH                   0x00000001

#define _DEVCFG0_ICESEL_POSITION                 0x00000003
#define _DEVCFG0_ICESEL_MASK                     0x00000018
#define _DEVCFG0_ICESEL_LENGTH                   0x00000002

#define _DEVCFG0_TRCEN_POSITION                  0x00000005
#define _DEVCFG0_TRCEN_MASK                      0x00000020
#define _DEVCFG0_TRCEN_LENGTH                    0x00000001

#define _DEVCFG0_BOOTISA_POSITION                0x00000006
#define _DEVCFG0_BOOTISA_MASK                    0x00000040
#define _DEVCFG0_BOOTISA_LENGTH                  0x00000001

#define _DEVCFG0_FECCCON_POSITION                0x00000008
#define _DEVCFG0_FECCCON_MASK                    0x00000300
#define _DEVCFG0_FECCCON_LENGTH                  0x00000002

#define _DEVCFG0_FSLEEP_POSITION                 0x0000000A
#define _DEVCFG0_FSLEEP_MASK                     0x00000400
#define _DEVCFG0_FSLEEP_LENGTH                   0x00000001

#define _DEVCFG0_DBGPER_POSITION                 0x0000000C
#define _DEVCFG0_DBGPER_MASK                     0x00007000
#define _DEVCFG0_DBGPER_LENGTH                   0x00000003

#define _DEVCFG0_SMCLR_POSITION                  0x0000000F
#define _DEVCFG0_SMCLR_MASK                      0x00008000
#define _DEVCFG0_SMCLR_LENGTH                    0x00000001

#define _DEVCFG0_SOSCGAIN_POSITION               0x00000010
#define _DEVCFG0_SOSCGAIN_MASK                   0x00030000
#define _DEVCFG0_SOSCGAIN_LENGTH                 0x00000002

#define _DEVCFG0_SOSCBOOST_POSITION              0x00000012
#define _DEVCFG0_SOSCBOOST_MASK                  0x00040000
#define _DEVCFG0_SOSCBOOST_LENGTH                0x00000001

#define _DEVCFG0_POSCGAIN_POSITION               0x00000013
#define _DEVCFG0_POSCGAIN_MASK                   0x00180000
#define _DEVCFG0_POSCGAIN_LENGTH                 0x00000002

#define _DEVCFG0_POSCBOOST_POSITION              0x00000015
#define _DEVCFG0_POSCBOOST_MASK                  0x00200000
#define _DEVCFG0_POSCBOOST_LENGTH                0x00000001

#define _DEVCFG0_EJTAGBEN_POSITION               0x0000001E
#define _DEVCFG0_EJTAGBEN_MASK                   0x40000000
#define _DEVCFG0_EJTAGBEN_LENGTH                 0x00000001

#define _DEVCFG0_FDEBUG_POSITION                 0x00000000
#define _DEVCFG0_FDEBUG_MASK                     0x00000003
#define _DEVCFG0_FDEBUG_LENGTH                   0x00000002

#define _DEVCFG0_w_POSITION                      0x00000000
#define _DEVCFG0_w_MASK                          0xFFFFFFFF
#define _DEVCFG0_w_LENGTH                        0x00000020

#define _DEVCP0_CP_POSITION                      0x0000001C
#define _DEVCP0_CP_MASK                          0x10000000
#define _DEVCP0_CP_LENGTH                        0x00000001

#define _DEVCP0_w_POSITION                       0x00000000
#define _DEVCP0_w_MASK                           0xFFFFFFFF
#define _DEVCP0_w_LENGTH                         0x00000020

#define _SEQ3_TSEQ_POSITION                      0x00000000
#define _SEQ3_TSEQ_MASK                          0x0000FFFF
#define _SEQ3_TSEQ_LENGTH                        0x00000010

#define _SEQ3_CSEQ_POSITION                      0x00000010
#define _SEQ3_CSEQ_MASK                          0xFFFF0000
#define _SEQ3_CSEQ_LENGTH                        0x00000010

#define _SEQ3_w_POSITION                         0x00000000
#define _SEQ3_w_MASK                             0xFFFFFFFF
#define _SEQ3_w_LENGTH                           0x00000020

#define _DEVADC0_ADCFG_POSITION                  0x00000000
#define _DEVADC0_ADCFG_MASK                      0xFFFFFFFF
#define _DEVADC0_ADCFG_LENGTH                    0x00000020

#define _DEVADC0_w_POSITION                      0x00000000
#define _DEVADC0_w_MASK                          0xFFFFFFFF
#define _DEVADC0_w_LENGTH                        0x00000020

#define _DEVADC1_ADCFG_POSITION                  0x00000000
#define _DEVADC1_ADCFG_MASK                      0xFFFFFFFF
#define _DEVADC1_ADCFG_LENGTH                    0x00000020

#define _DEVADC1_w_POSITION                      0x00000000
#define _DEVADC1_w_MASK                          0xFFFFFFFF
#define _DEVADC1_w_LENGTH                        0x00000020

#define _DEVADC2_ADCFG_POSITION                  0x00000000
#define _DEVADC2_ADCFG_MASK                      0xFFFFFFFF
#define _DEVADC2_ADCFG_LENGTH                    0x00000020

#define _DEVADC2_w_POSITION                      0x00000000
#define _DEVADC2_w_MASK                          0xFFFFFFFF
#define _DEVADC2_w_LENGTH                        0x00000020

#define _DEVADC3_ADCFG_POSITION                  0x00000000
#define _DEVADC3_ADCFG_MASK                      0xFFFFFFFF
#define _DEVADC3_ADCFG_LENGTH                    0x00000020

#define _DEVADC3_w_POSITION                      0x00000000
#define _DEVADC3_w_MASK                          0xFFFFFFFF
#define _DEVADC3_w_LENGTH                        0x00000020

#define _DEVADC4_ADCFG_POSITION                  0x00000000
#define _DEVADC4_ADCFG_MASK                      0xFFFFFFFF
#define _DEVADC4_ADCFG_LENGTH                    0x00000020

#define _DEVADC4_w_POSITION                      0x00000000
#define _DEVADC4_w_MASK                          0xFFFFFFFF
#define _DEVADC4_w_LENGTH                        0x00000020

#define _DEVADC7_ADCFG_POSITION                  0x00000000
#define _DEVADC7_ADCFG_MASK                      0xFFFFFFFF
#define _DEVADC7_ADCFG_LENGTH                    0x00000020

